Revit 2027 API
LabelUtils.GetLabelFor(BuiltInCategory) Method
 Gets the user-visible name for a BuiltInCategory.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string GetLabelFor(
	BuiltInCategory builtInCategory
)
Public Shared Function GetLabelFor (
	builtInCategory As BuiltInCategory
) As String
public:
static String^ GetLabelFor(
	BuiltInCategory builtInCategory
)
static member GetLabelFor :
        builtInCategory : BuiltInCategory -> string
Parameters
builtInCategory BuiltInCategory
 The BuiltInCategory to get the user-visible name.
Return Value
String
Exceptions
Exception | Condition
InvalidOperationException |  Thrown when the builtin category is not valid.
Remarks
 The name is obtained in the current Revit language.
See Also
Reference
LabelUtils Class
GetLabelFor Overload
Autodesk.Revit.DB Namespace